[
  {
    "title": "Golden Tofu Wrap with Warm Asian Slaw",
    "ingredients": "1 tb Peanut oil|1 lb Low-fat extra-firm tofu OR firm; drained and cut into 1-inch cubes, blotted dry|2 md Garlic cloves; minced|1 sm Jalapeno OR other fresh chile; stemmed seeded if desired, minced|1 1/2 lb Red cabbage; shredded as directed|2 tb Rice wine vinegar|2 tb Soy sauce|2 tb Minced fresh cilantro leaves|4 lg Whole-wheat tortillas; (12-inch)",
    "servings": "4 servings",
    "instructions": "INTRO: Golden brown pieces of sauteed tofu are a good foil for a cabbage slaw with Asian seasonings. Serve any extra slaw on the side. For less heat, remove the seeds from the Chile before mincing. 1. Prepare the cabbage. Remove tough outer leaves; quarter. Trim: remove tough white stem/parts. Slice crosswise into very thin strips. 2. Heat 1 tablespoon oil until almost smoking in large nonstick skillet set over medium-high heat. Add tofu and cook, turning pieces every minute or so, until golden brown, about 5 minutes. Transfer tofu to medium bowl. 3. Add garlic and jalapeno to empty skillet and stir-fry over high heat until fragrant, about 20 seconds. Add cabbage and stir-fry until slightly wilted, about 2 minutes. Add vinegar and soy sauce, cover, and cook until cabbage is crisp-tender, about 5 minutes. Stir in cilantro and remove pan from heat. Allow slaw to cool slightly. 4. Meanwhile, heat each tortilla until warm in clean skillet set over medium heat. Lay tortillas flat on work surface. Spread about 3/4 cup slaw down center of each and top with several pieces of tofu. Roll up, tucking sides toward center to form bundle. Slice each roll in half and serve immediately. PER SERVING: 200 calories, 25 percent from fat. 14g protein, 6g fat, 32g carbs, 6g fiber, 672 mg sodium. Good source vitamin C. mc by kitpath 4/27/99"
  },
  {
    "title": "Bean Thread Noodles with Beef And Asian Pear",
    "ingredients": "1/4 lb Bean-thread noodles; (also known as cellophane noodles)|4 Garlic cloves; minced|1/3 c Soy sauce|2 tb Sugar|1 tb Asian sesame oil|1 ts Dried hot red pepper flakes|1/2 c Plus 1 teaspoon rice vinegar; (not seasoned)|1 lb Filet mignon; cut into 1/4-inch-thick julienne strips|2 cn Beef broth; (14 1/2-oz)|1/4 c Water|1 Asian pear; cut into julienne strips|2 Scallions; (green parts only), thinly sliced",
    "servings": "1 servings",
    "instructions": "Soak noodles in a bowl of cold water until pliable, about 15 minutes, and drain. Cut into 2-inch lengths. While noodles are soaking, stir together garlic, soy sauce, sugar, sesame oil, red pepper flakes, and 1/2 cup vinegar. Add beef and marinate at room temperature, stirring occasionally, 15 minutes. Bring broth and water to a boil. Add beef and marinade and cook 2 minutes. Stir in noodles and cook until just tender, about 2 minutes. Toss pear and scallions with remaining teaspoon vinegar. Spoon noodles and broth into bowls and top with pear and scallions. Makes 4 servings."
  },
  {
    "title": "Beer Battered Soft-Shell Crabs with Asian Dipping Sauce",
    "ingredients": "=== BEER BATTER ===|1 c All purpose flour - (scant); plus extra|For dusting|12 oz Beer; reserving 4 oz|To thin batter if necessary|=== SAUCE ===|3 tb Fresh lime juice|3 tb Thai fish sauce; (nam plo)|(available at speciality or Asian markets)|1 tb Honey|3 tb Water|2 Garlic cloves; minced|1 Scallion; thinly sliced|2 sl Habenero; Scotch bonnet, or jalapeno|Chile; (very thin slices), see * Note|=== CRABS ===|4 md Soft-shell crabs; cleaned, rinsed|Milk; for soaking crabs|Salt; to taste|Freshly-ground black pepper; to taste|Peanut oil; for frying|=== GARNISH ===|Scallion brushes|Cilantro sprigs|Lime wedges",
    "servings": "4 servings",
    "instructions": "* Note: Select chile type depending on desired degree of heat wanted. Put the flour into a bowl and make a well in the center. Pour 1 cup of the beer into the well and whisk until the mixture is just combined. Strain the batter through a sieve into a clean bowl and let it rest, covered, for 1 hour. Before using batter, whisk in additional beer, if necessary, to achieve desired consistency. In a small bowl whisk together the lime juice, fish sauce and honey until dissolved. Add the water, garlic, scallion and chili slices. Set aside. Clean the soft-shell crabs by first cutting away the eyes and mouth. Lift up the top side flaps and pull out the feathery gills. Turn the crab over and fold back the tail flap, also called the apron, and pull away from the body and discard. Place crabs in a shallow dish and add enough milk to cover. Soak crabs for 10 to 15 minutes. In a heavy deep pan heat 2 inches of peanut oil to 350 degrees. Season the crabs with salt and pepper. Dust the crabs with flour, shaking off any excess. Coat and fry crabs two at a time. Dip each crab into the beer batter and allow extra batter to drip back into bowl. Carefully lower the crabs into the heated oil and fry until golden brown, turning once, about 2 minutes per side. Transfer fried crabs to paper towels to drain. Repeat process with remaining two crabs. Arrange crabs on individual serving plates. Garnish with scallion brushes, cilantro sprigs and lime wedges. Serve immediately with dipping sauce on the side. This recipe yields 4 servings."
  },
  {
    "title": "SE Asian Cabbage Salad with Cucumber Peanuts and Cilantro",
    "ingredients": "1 Head white cabbage, cored, thinly sliced|4 To 6 garlic cloves, chopped|1/2 English cucumber, cut into bite-sized pieces|1 Carrot, coarsely grated|1/2 c Distilled white vinegar|3 tb Sugar or honey|3 tb Soy sauce or fish sauce|2 Fresh chiles, seeded, chopped|1/4 c Mild vegetable oil|2/3 c Dry-roasted peanuts, coarsely chopped|2 To 3 tablespoons coarsely chopped cilantro",
    "servings": "4 Servings",
    "instructions": "Toss cabbage with garlic, cucumber, carrot, vinegar, sugar or honey, soy sauce or fish sauce, chiles and vegetable oil. Chill until ready to serve, then top with peanuts and cilantro. Serves 4 to 6. PER SERVING: 205 calories, 6 g protein, 11 g carbohydrate, 17 g fat (2 g saturated), 0 mg cholesterol, 535 mg sodium, 4 g fiber."
  },
  {
    "title": "Seared Ahi Served with Floral of Asian Greens (Hl)",
    "ingredients": "6 oz Ahi or yellow fin tuna|1 Nori sheet|Salt and pepper; to taste --floral greens---|1 Roma tomato|6 Enoki mushrooms|6 Warabi sprouts|3 Mizuna leaves or asian greens --dressing---|2 Shallots|2 ts Olive oil|3 ts Red wine vinegar|1 sm Bunch chopped fresh parsley",
    "servings": "1 Servings",
    "instructions": "Season ahi with salt and pepper. Wrap nori sheet around ahi. Saute in a teflon pan. Floral Greens: Blanch tomato and peel, then hollow out the inside. Arrange enoki mushrooms, warabi sprouts and Asian greens in tomato. Dressing: Mix red wine vinegar, olive oil, shallots and parsley in bowl. Pour over the Floral Greens. Yield: 1 serving Recipe courtesy of Chef Mark Tsuchiyama, Sheraton Maui"
  },
  {
    "title": "Seared Cervena Venison with Asian Pan Juice",
    "ingredients": "8 Cervena medallions, (8 to 3)|2 tb Mixed toasted black and white sesame seeds|2 tb Olive oil|1 ts Chopped scallions|1 ts Chopped garlic|1/4 c Chicken stock|1 tb Oyster sauce|1 ts Dark soy sauce|1 Piece star anise|1 tb Chopped cilantro|1 tb Butter|4 tb Leeks, julienned|2 c Peanut oil for frying",
    "servings": "1 Servings",
    "instructions": "Roll the Cervena medallions in the sesame seeds and set aside. In a large skillet over high heat, heat the olive oil and sear medallions on each side, set aside on oven tray. In the skillet saute the scallions and garlic for a few minutes. Add chicken stock, oyster sauce, soy sauce, star anise and cilantro. Simmer for about 6 minutes. Strain. Fry the leeks and finish cooking the medallions in a 400 degree oven for 5 minutes. Rest the meat for three minutes. In the meantime bring the sauce back to a boil and whisk in butter. Transfer to serving plate and spoon sauce over meat. Top with fried leeks. Yield: 4 servings"
  },
  {
    "title": "Marinated Asian Vegetable Salad",
    "ingredients": "1/4 lb Chinese peas|1/2 lb Bok choy (white stemmed cabbage), coarsely chopped|1/2 lb Won bok (celery cabbage); coarsely chopped|1/4 lb Daikon; shredded in long strands|1/4 lb Carrot; shredded in long strands|1/3 cn (15 oz size) bamboo shoots strips|1/4 lb Fresh shiitake mushrooms; sliced|1/3 cn (15 oz size) baby corn|1/4 c Rice vinegar|1/4 c Sesame oil|1/4 c Water|1/4 c Soy sauce|1 tb Sugar|2 Cloves garlic; minced|1 Piece (1/2-inch) ginger root, minced|1 tb Wasabi (horseradish paste)|1 tb Minced Maui onion|1 tb Chopped green onion|Green lettuce leaves|1 Sheet nori; cut into thin strips|1 tb Toasted black and white sesame seed",
    "servings": "1 Servings",
    "instructions": "Blanch Chinese peas, bok choy, and won bok. In a bowl, combine the blanched vegetables with daikon, carrot, bamboo shoots, mushrooms, and corn. To make marinade, combine rice vinegar, sesame oil, water, soy sauce, sugar, garlic, ginger, wasabi, onion, and green onion; mix well. Pour marinade over vegetables and refrigerate for 30 minutes. To serve, place vegetables on lettuce leaves. Top with nori strips and sesame seed. Makes 6 servings. >From I Love Country Cafe"
  },
  {
    "title": "Chinese Chicken Broth [Asian Noodles]",
    "ingredients": "3 1/2 lb Chicken bones; necks, backs, and/or pieces|9 c Water|1 c Chines rice wine OR sake|6 sl Fresh ginger root; lightly pounded, about the size of a quarter",
    "servings": "1 servings",
    "instructions": "1. COmbine the chicken bones, water, rice wine, and ginger in a large pot and bring to a boil. Reduce heat to low and simmer, uncovered, for 1 1/2 hours. Skimming the surface to remove any foam or impurities. 2. Strain the broth through a fine strainer into a bowl or another pot. Skim to remove any fat. (Alternatively, cool and refrigerate the broth and then rove the solidified fat.) Makes about 6 cups."
  },
  {
    "title": "Tropical Asian Curry Paste",
    "ingredients": "1/4 c Peeled; chopped fresh tumeric|(can substitute with 2 tbspns ground|Tumeric)|1/4 c Peeled; chopped galangal|1 c Cilantro stems|1/2 c Peeled; chopped garlic|3 Lemon grass stalks; white part only, chopped|1/2 c Fish sauce; (3 Crab brand)|1/2 c Fresh lime juice|1 c Peeled shallots|1/2 c Toasted Thai bird chiles|5 tb Toasted; coarse-ground coriander seed|2 tb Toasted; coarse-ground cumin seed|2 tb Toasted; coarse-ground black peppercorn|2 tb Kosher salt|2 c Peanut oil|(could substitute with canola oil;|But the taste is far superior with|Lion & Globe brand peanut oil)",
    "servings": "1 servings",
    "instructions": "Using a food processor and a sharp metal blade, puree the tumeric, galangal, cilantro, garlic, lemon grass and lime juice. Make sure a smooth puree is achieved. Add shallots, chiles, spices and salt. While pureeing, drizzle in the oil. Check for seasoning. Can store in refrigerator and will hold at least 2 weeks."
  },
  {
    "title": "Carrot And Red Lentil Soup with Asian Spices",
    "ingredients": "2 oz Unsalted butter|1 1/2 tb Grated fresh ginger|1/4 ts Cayenne pepper|1/4 ts Allspice|1/4 ts Cumin|1/2 ts Curry powder|1/2 ts Ground coriander|2 Onions; finely sliced|1 Parsnip; peeled and diced|1 Stick celery; sliced|2 lb Carrots; peeled and sliced|1 1/2 ts Salt|1/2 ts Ground black pepper|2 oz Red lentils|1 2 ounces lon grain rice|3 1/2 pt Vegetable stock|1/2 pt Unsweetened coconut milk|2 tb Lime juice|Fresh coriander to garnish",
    "servings": "1 servings",
    "instructions": "Melt the butter over a low heat and stir in ginger and spices. Cook for 1 minute. Add the onions, parsnips, celery and carrots. Season with salt and pepper. Cook for 12 minutes over an increasing flame, soften but do not brown. Stir in the lentils and the rice, combine with the vegetables. Add stock and bring to the boil. Simmer for 30 minutes or until vegetables and rice are thoroughly cooked. Liquidize in a blender until smooth. Return soup to the saucepan. Add coconut milk, lime juice and chopped coriander. Check seasoning. Do not reboil, as otherwise it will separate."
  }
]
