[
  {
    "title": "Halkoum (Turkish Delight)",
    "ingredients": "1 lb Glucose|5 1/2 lb Granulated sugar|3/4 lb Cornstarch|1 Lemon; juice of|1 ts Pulverized mastic|3 dr Food coloring; if desired, more or less|3 tb Orange blossom water or rose water (up to)|4 oz Almonds or pistachios; chopped|Cornstarch to dust the tray|Powdered sugar",
    "servings": "64 Servings",
    "instructions": "Bring to a boil again, and cook, uncovered, over a constant low flame for 3 hours, stirring as often as possible with a wooden spoon. If the flame is too high, the bottom of the mixture will tend to carmelize. The mixture must be cooked until it reaches the right consistency. THis takes about 3 hours, and on this depends the success of the recipe. To test the consistency, squeeze a small blob of the mixture between two fingers. Only when it clings to both fingers as they are drawn apart, making gummed threads, is it ready. It may then have acquired a warm golden color. Add the lemon juice and the flavorings. THe mastic should be ground with a little granulated sugar to be successfully pulverized. Add coloring if you wish. Stir vigorously and cook a few minutes longer. Add the chopped nuts and mix well. Pour the hot mixture out about 1 inch deep into trays that have been dusted with cornstarch to prevent sticking. Flatten it with a knife and leave it to set for at least 24 hours. THen cut into squares with a sharp knife, and roll in sifted powdered sugar. The Halkoum will keep for a long time packed in a box. From \"A Book of Middle Eastern Food\" by Claudia Roden /CANDY"
  },
  {
    "title": "Sebze Bastisi (Vegetable Stew - Turkish)",
    "ingredients": "1 Med. eggplant (about 1 lb)|4 tb Butter or olive oil|2 Onions; sliced|2 Green peppers *|2 Zucchini; sliced 1/4\" thick|1 c String beans; in 1 1/2\" pcs|2 Garlic cloves; crushed|2 tb Chopped parsley|1/2 ts Sugar|Salt|Freshly ground pepper|1 c Beef broth|2 tb Chopped parsley for garnish",
    "servings": "4 Servings",
    "instructions": "*Note: Green peppers should be seeded and cut into strips. Cut eggplant into 1/4\" slices, sprinkle with salt and set aside for 30 min. Wash off salt, drain and pat dry with paper towels. Heat 2 T. butter in a skillet. Add the eggplant slices and fry until browned on both sides. Transfer to a baking dish. Fry the onions and peppers in the remaining butter for 3 min. Add the zucchini and beans and fry for 2 more min, stirring frequently. Place the veggies on top of the eggplant. Add garlic, parsley, sugar, pepper salt, and beef broth. Cover and place in a 350 oven for 1 hour. Garnish with parsley and serve hot."
  },
  {
    "title": "Red Lentil Soup (Turkish)",
    "ingredients": "1 1/2 c Red lentils|8 c Meat stock|2 md Size onions|2 tb Butter|1/2 tb Flour|1 c Milk|3 Egg yolks|1 tb Salt|1/2 ts Black pepper|6 Slices of bread|2 tb Oil",
    "servings": "1 Servings",
    "instructions": "1- Wash the lentils. Put them in meat stock and 1 cup of water. Cook for 35-40 minutes until they are tender. Pass them through a sieve. 2- Melt the butter in anothe saucepan. Add chopped onions and fry them lightly for 7-8 minutes. Add flour. Brown for 1 minute more. Add them to the meat stock with the lentil puree. Add slat and pepper and let simmer. 3- Beat the egg yolks with cold milk. Add to the boiling soup, mix well. Turn the heat off as soon as it starts boiling. Serve with bread cubes fried in oil."
  },
  {
    "title": "Red Lentil Soup with Rice (Turkish)",
    "ingredients": "1 c Red lentils|2 md Size onions|1 md Size potato|2 tb Rice|1 l Meat stock or water|2 tb Butter|Salt, paprika",
    "servings": "1 Servings",
    "instructions": "1- Wash lentils and the rice. Add the peeled and chopped onions and tomatoes , peeled potato cut into very small cubes and the meat stock. Cover and cook on low heat for 45 minutes. Pass them through a sieve. 2- Melt the butter in another saucepan. Add paprika and pour over the soup."
  },
  {
    "title": "Lokum (Turkish Delight)",
    "ingredients": "4 c Granulated sugar|4 1/2 c Water|1 ts Lemon juice|1 c Cornflour (cornstarch)|1 ts Cream of tartar|1 tb Rose water (may be doubled)|Red food coloring|1/2 c Chopped; toasted almonds|3/4 c Confectioners' sugar|1/4 c Cornflour (cornstarch)",
    "servings": "16 Servings",
    "instructions": "Bring to the boil and boil to soft ball stage 115 C (240 F) on a candy thermometer. Remove from heat. In another thick-based pan blend cornflour, cream of tartar and 1 cup cold water until smooth. Boil remaining 2 cups water and stir into cornflour mixture, then place over low heat. Stir constantly until mixture thickens and bubbles. Use a balloon whisk if lumps form. Pour hot syrup gradually into cornflour mixture, stirring constantly. Bring to the boil and gently for 1-1/4 hours. Stir occasionally with a wooden spoon and cook until mixture is a pale golden colour. Stirring is essential. Stir in rose water to taste and a few drops of red food colouring to tinge it pale pink. Blend in nuts if used, and remove from heat. Pour into an oiled 23 cm (9 inch) square cake tin and leave for 12 hours to set. Combine confectioners' sugar and the 1/4 cup cornflour in a flat dish. Cut Turkish Delight into squares with an oiled knife and toss in sugar mixture. Store in a sealed container with remaining sugar mixture sprinkled between layers. VARIATIONS: Creme de Menthe Lokum: Replace rose water and red food colouring with 2 tablespoons Creme de Menthe liqueur and a little green food colouring. Omit nuts. Orange Lokum: Use 1-2 tablespoons orange flower water instead of rose water; use orange food colouring. Vanilla Lokum: Use 2 teaspoons vanilla essence instead of rose water and colouring, stir in 1/2 cup toasted chopped almonds or chopped walnuts. Do not blanch almonds. MEAL-MASTER RECIPES LIST SERVER"
  },
  {
    "title": "Stuffed Zucchini, Turkish Style",
    "ingredients": "4 md Zucchini, halved lengthwise|3 tb Butter|3/4 c Finely minced onion|3 cl Crushed garlic|3 Beaten eggs|1/2 c Crumbled feta cheese|3/4 c Grated Swiss cheese|2 tb Freshly chopped parsley|1 tb Fresh, chopped dill (or 3/4|Tsp. dried dill weed)|1 1/2 tb Flour|Salt and pepper to taste|Paprika for the top",
    "servings": "4 Servings",
    "instructions": "Scoop out the insides of the zucchini to leave a 1/2\" rim. Chop the innards into little bits and cook in butter with onions, garlic, salt and pepper until onions are soft. Combine with flour, cheeses, herbs and beaten eggs. Correct salt and pepper. Fill the zucchini cavities and dust the tops with paprika. Bake at 375 for 30 min. or until the filling soldifies. Serve with a fresh tomato salad."
  },
  {
    "title": "Simit (Turkish Croissant with Sesame Seeds)",
    "ingredients": "8 oz Flour|1/2 ts Salt|2 oz Margarine|1 tb Olive oil|1 tb Milk, plus extra|1 tb Water|1 Egg|Sesame seeds",
    "servings": "1 Servings",
    "instructions": "Put the flour and salt in a large bowl and make a hole in the middle. Into this hole pour the melted marg, olive oil, milk, water and beaten egg. Stirring from the outside into the middle gradually mix all the liquids into the flour until you have a dough. It will feel a bit oily, but is quite manageable. With floured hands shape the dough into rings about the diameter of a saucer and arrange them on a baking sheet. Brush them over with milk and sprinkle the sesame seeds on them. Bake them in a 400 degree oven for approx. 30 min. or until they are nicely browned."
  },
  {
    "title": "Cold Turkish Green Tomato Soup",
    "ingredients": "3 lb Green tomatoes; seeded, chopped|2 c Chicken broth|1/4 c Plain yogurt|1 sm Red bell pepper; cut into matchsticks|1/4 c Packed fresh dill sprigs minus tough; washed well, stems|Spun dry; and chopped|Crumbled feta; for garnish",
    "servings": "7 servings",
    "instructions": "In a large saucepan simmer tomatoes in broth 6 minutes. In a blender puree tomato mixture with yogurt in small batches until smooth and season with salt and pepper. Cool soup completely. Chill soup, covered, until cold, about 2 hours. Season soup with salt and pepper and top with bell pepper and dill. Garnish soup with feta. This recipe yields approximately 7 cups. Per serving: 68 Calories (kcal); 1g Total Fat; (13% calories from fat); 4g Protein; 12g Carbohydrate; 1mg Cholesterol; 248mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 2 Vegetable; 0 Fruit; 0 Fat; 0 Other Carbohydrates"
  },
  {
    "title": "Menemen (Turkish Scrambled Eggs)",
    "ingredients": "1 Onion|4 Tomatoes|4 Green hot peppers|5 tb Butter|8 Eggs|Salt|Pepper|1 ts Mild paprika powder",
    "servings": "4 Servings",
    "instructions": "Chop the onion finely. Cut a cross in the top of the tomatoes and put them in hot water. Remove the skins. Cut the tomatoes into small pieces. Wash the peppers and cut them into very small rings. Heat the butter in a big skillet. Sautee the onion until soft, then add peppers and tomatoes and fry for another 2 to 3 minutes. Beat the eggs with salt and pepper and paprika powder. Pour mixture over vegetables. Keep stirring with a fork until set. (Serve on nice fresh homemade or -of course- Turkish bread) Be careful with the peppers. Peppers used here are the Turkish kind, a cross between parika's and hot peppers. Remove the seeds to make them less hot."
  },
  {
    "title": "Grilled Fish in Turkish Marinade of Yogurt, Coriander,",
    "ingredients": "1 c Nonfat or low-fat yogurt|1 tb Ground coriander|1/2 tb Ground cardamom|1 ts Freshly ground black pepper|1 ts Salt|3 tb Fresh lemon juice|6 5- to 6-ounce fillets of a firm whitefish, such as cod, halibut, flounder, sea bass, or swordfish|2 tb Chopped dill (optional) for garnish",
    "servings": "6 Servings",
    "instructions": "(... grilled fish in a simple yogurt marinade that makes an enormous difference in moisture and flavor, with the easily obtained but slightly exotic spices cardamom and coriander, common in Turkey.CORBY) As the Turks, Greeks, and Indians know, yogurt makes a great marinade for fish or chicken. It tenderizes as it seasons, and provides a tart balance for the sweet spices. This is an ideal dish for a busy day when you have a great desire for flavor but little time to cook. Combine all of the ingredients and marinate the fish fillets for 3 to 6 hours. Preheat the broiler or make a charcoal fire. Wipe off excess marinade, brush the fish lightly with oil, and sprinkle with salt and pepper. Broil or grill for about 4 minutes per side. Garnish with chopped dill, if desired, and serve with a lemon wedge. You may also cook the fish on a lightly oiled baking sheet in a 400 degree oven for about 12 minutes, or until done."
  }
]
