[
  {
    "title": "Coffee Liquor Dipper Wings",
    "ingredients": "1 oz Butter|1/2 c Onion, finely chopped|3/4 ts Chile powder|2 dr Hot sauce|1 c Barbecue sauce|2 tb Honey|Salt and pepper to taste|2 Cl Garlic, minced|1 ts Cumin|1/2 c Coffee liqueur|2 tb Worcestershire sauce|1 ts Salt|20 Chicken wings",
    "servings": "8 Servings",
    "instructions": "In a 2 Qt. saucepan melt butter; saute garlic and onion over medium heat for 3 minutes. Add cumin and chili powder and cook, stirring constantly for 2 minutes. Blend in Coffee Liqueur and cook to reduce liquid by one-half. Stir in hot sauce, Worcestershire, barbeque sauce and salt. Simmer 5 minutes. Remove from heat and add honey. Set aside and allow to cool. Prepare chicken wings by removing and discarding the tips. Divide the wings in half at the remaining joint. Marinate the wings in the cooked sauce for 1 hour at room temperature, or overnight in the refrigerator. To cook,, place the marinated wings on a broiler pan, sprinkle with salt and pepper and broil 5 minutes, turn and brush with the remaining sauce and bake at 350 degrees for 15 minutes. Serve hot. Wings can be prepared a day ahead and can be reheated in the oven."
  },
  {
    "title": "Frozen Liquorice And Blackcurrant Parfait",
    "ingredients": "5 Egg yolks|120 g Caster sugar|400 ml Double cream|1 Leaf gelatine; soaked in cold water|8 Dariole moulds|250 g Blackcurrants|100 g Icing sugar|150 g Chopped liquorice sticks|1/2 pt Water",
    "servings": "1 servings",
    "instructions": "In a small pan, dissolve the liquorice in half a pint of water over a low heat. Add the soaked gelatine leaf, then pass through a fine strainer and put to one side. In a blender, blitz the blackcurrants and icing sugar together and pass through a fine strainer then put to one side. Put the caster sugar and water in a pan and bring to the boil. Lower the heat and simmer. Using a sugar thermometer, allow the sugar to reach jam stage (240C). Put the yolks into a mixer and start whisking. As they become fluffy add the hot sugar syrup and whisk until cool. In another bowl, whisk up the cream to a thick consistency (but not stiff peaks). Pour in 2/3 of the blackcurrant sauce and gently fold through. Add the cool egg mixture and fold this through. Finally, drizzle in the liquorice syrup and fold through. Pour into moulds and freeze for 12 hours. To serve, dip the moulds in hot water and shake the parfaits out on to a plate. Serve with the remaining blackcurrant sauce."
  },
  {
    "title": "Oranges in Liqueur (Arance Al Liquore)",
    "ingredients": "1 Orange, zest of, thinly sliced|6 lg Oranges|1/2 c Chopped walnuts|2 tb Butter|1/3 c Sugar|1/4 c Cointreau (or other orange flavored liqueur),|Or brandy|1 Orange, juice of|NO-ALCOHOL VARIATION:|1 lg Lemon, juice of- instead of the butter and liqueur",
    "servings": "4 Servings",
    "instructions": "Servings: 4 to 6 DIRECTIONS: Fill a small saucepan one-third full with water. Bring water to a boil. Add orange zest and boil 3 to 5 minutes to reduce bitterness. Drain and dry well with paper towels. Cut ends off oranges. Set each orange on a cutting board and slice off peel, making sure to remove all white skin. Cut oranges into slices about 1/3 inch thick. Remove seeds. Arrange orange slices slightly overlapping on a large platter or in individual dishes. Sprinkle oranges with walnuts and set aside. Melt butter in a small saucepan. Stir in sugar, orange zest and Cointreau or brandy. Stir over medium heat until sugar is dissolved. Add orange juice. Cook, stirring occasionally, until sauce is a medium-thick consistency. Spoon over oranges and serve. Variation: Arrange sliced oranges on a platter or individual dishes and sprinkle with walnuts. Squeeze the juice of 1 large lemon over oranges and sprinkle with 1/3 cup sugar. Chill 20 to 30 minutes and serve."
  },
  {
    "title": "Baked Rum And Pecan Bananas with Liquorice Ice Cream",
    "ingredients": "6 Bananas; peeled and cut into halves|55 g Unsalted butter; (2oz)|55 g Demerara sugar; (2oz)|Zest and juice from 2 limes|Seeds from 1 vanilla pod|55 g Pecan nuts; (2oz)",
    "servings": "1 servings",
    "instructions": "Squeeze juice into a nowl and toss the bananas in this. Remove the fruit and lay in a single layer in a gratin dish. Save the juice. Pour the juice into a pan with the sugar, zest, butter and vanilla. Dissolve the sugar and then cook together to bubble and blend the flavours. Pour over the fruit and scatter with chopped nuts. Bake in hot oven or under the grill until golden and crusty on top. Serve with scoops of liquorice ice-cream."
  },
  {
    "title": "Cranberry Liquor",
    "ingredients": "1 lb Cranberries|2 c Sugar|1 qt Vodka; 100 Proof",
    "servings": "1 Servings",
    "instructions": "1. Put all ingredients in blender. 2. Strain into cheese cloth. 3. Ready to sere immediately."
  },
  {
    "title": "Greens with Pot Liquor",
    "ingredients": "1 ts Vegetable oil|1 c Thinly sliced onion|2 Minced garlic cloves|10 c Washed, trimmed and coarsely chopped greens (try kale, collard, mustard or turnip)|3 c Low-sodium chicken broth or Ham Broth (see recipe)|1 ts Granulated sugar|1 ts Cider vinegar|1 pn Ground red pepper (optional)",
    "servings": "1 Servings",
    "instructions": "1. Place large, deep nonstick skillet or saucepan over medium heat 30 seconds. Add oil; heat 30 seconds. Add onion and saute until wilted, about 5 minutes. Add garlic; cook 1 minute longer. 2. Add greens and toss until slightly wilted, 1-2 minutes. Add broth, sugar, vinegar and ground red pepper, if using; bring to a boil. Reduce heat to low, cover and simmer until tender, about 10 minutes. Divide greens and broth (\"pot liquor\") evenly into 4 serving bowls."
  },
  {
    "title": "Make Fast - Wait Long Liquor",
    "ingredients": "2 c Sugar (raw sugar is best,|White is also fine)|1 l Vodka (the cheapest|Available)|2 c Nectar (can use herb|Extracts, coffee, etc.)",
    "servings": "1 Servings",
    "instructions": "Heat the nectar and sugar until disolved, cool, add the vodka and store in airtight bottles ... and let it sit for a year. I put a piece of firm fruit in the bottle also. Looks great and adds to the flavor. I also use jackfruit, lychee, guava and other tropical fruits growing in my (or neighbors') yard. A friend made some with anis seeds and it it golden ambrosia! If these fruit are not available, get a can of fruit in syrup and mix the syrup with the vodka, adding some of the fruit. Jackfruit and lychee are very distinctive and delicious. (For those who like a sweeter, more syrupy liquor, use a little less vodka or more sugar. This recipe is a little on the tart side, but after a year on the shelf, it gets as mellow as as the best. The sweeter ones are a real treat on vanilla Tofutti or other VLF ices."
  }
]
