[
  {
    "title": "Enchiladas American Style",
    "ingredients": "Oil|1 pk (8-oz) frozen tortillas|1 cn (15-oz) chili no beans; warmed|1 cn (10oz) enchilida sauce; warmed|Chopped onion|Chopped bell pepper|Grated cheese|Chopped lettuce|Chopped tomatoes",
    "servings": "4 Servings",
    "instructions": "Fry tortillas in hot oil for 3 seconds. Drain. In casserole, top each tortilla with chili and cheese. Repeat in layers several times. Final topping: lettuce, tomato, pepper and onion. Cover with enchilada sauce. MRS DENNIS STORY (EDWYNNE) MARVELL, AR"
  },
  {
    "title": "Great American Steakhouse Balsamic Dijon Dipping Sauce-0 Poi",
    "ingredients": "1/4 c Balsamic vinegar|1 ts Spoonable Equal sweetener|1 ts Water|2 tb Honey mustard|1 ds Salt|1 ds Black pepper",
    "servings": "4 servings",
    "instructions": "1. Combine all ingredients in small bowl and mix well. Chill. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 9.5 Calories, 0.6g Fat, 0g Fiber Weight Watcher Points: 0"
  },
  {
    "title": "Great American Steakhouse Cheese Dipping Sauce - 3 Points",
    "ingredients": "2 tb Brummel and Brown Spread|2 tb All-purpose flour|1 ts Salt|1 c Skim milk|16 tb Reduced fat cheddar cheese|1 ts Mustard; any type|1 ds Seasoned salt|1 ds Black pepper",
    "servings": "4 servings",
    "instructions": "1. In a sauce pan, melt Brummel and Brown. 2. Add flour and salt. Stirring continually, heat until bubbly. 3. Slowly add milk. Continue stirring over medium heat until mixture has thickened. 4. Add cheese and mustard. Stir until cheese is melted. 5. Serve warm. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 110.4 Calories, 4.7g Fat, 0.2g Fiber Weight Watcher Points: 3"
  },
  {
    "title": "Great American Steakhouse Creamy Dill Dipping Sauce -1 Point",
    "ingredients": "1/2 c Fat-free sour cream|1/4 c Miracle Whip Free|2 tb Dill weed|1 ts Lemon juice|1 ds Salt|1 ds Pepper",
    "servings": "4 servings",
    "instructions": "1. Combine all ingredients in a small mixing bowl. Mix well. 2. Chill for 1 to 2 hours. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 38.4 Calories, 0.1g Fat, 0g Fiber Weight Watcher Points: 1"
  },
  {
    "title": "Great American Steakhouse Dry Onion Mix - 2 Points",
    "ingredients": "1 1/4 c Wheat flour|1 1/4 ts Seasoned salt|1 1/4 ts Onion powder|3/4 ts Dry mustard|1 ts Paprika|1 1/4 ts Garlic powder|1 1/4 ts Black pepper|1 tb Cajun seasoning|1 lg Sweet onions; cut to form bloom|1/2 c Better'n'Eggs|1/2 c Skim milk",
    "servings": "4 servings",
    "instructions": "1. Sift or mix the above ingredients together in a medium mixing bowl. 2. Cut onion to form bloom with machine. 3. Place onion in bowl of ice water and soak for 1 hour. Remove and shake of excess water. 4. Lightly sprinkle onion top with mix. Turn onion on side and sprinkle sides and between each petal. Turn onion root side up and shake gently to remove excess mix. 5. In large bowl mix Better'n'Eggs and milk. Lightly beat to form a wet batter. 6. With root side down, place onion into batter. Spread petals to ensure batter covers each petal. 7. Bake on a cookie sheet for 30 minutes at 375 degrees F or until golden brown. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 177.4 Cal, 1.2g Fat, 6g Fiber Weight Watcher Points: 2"
  },
  {
    "title": "Great American Steakhouse Ranch Dipping Sauce - 1 Point",
    "ingredients": "3/4 c Fat-free plain yogurt|1/3 c Miracle Whip Free|1 pk Dry ranch dressing",
    "servings": "4 servings",
    "instructions": "1. Combine all ingredients. Mix well. 2. Refrigerate overnight or at minimum several hours. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 63.8 Calories, 0.1g Fat, 0g Fiber Weight Watcher Points: 1"
  },
  {
    "title": "Great American Steakhouse Russian Dipping Sauce - 1 Point",
    "ingredients": "1 c Miracle Whip Free|3 tb Ketchup|1 ts Onion powder|1 sm Green pepper; finely minced|1 ds Seasoned salt",
    "servings": "4 servings",
    "instructions": "1. Combine all ingredients in a small mixing bowl. Mix well. 2. Chill. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 78.6 Calories, 0.1g Fat, 0.5g Fiber Weight Watcher Points: 1"
  },
  {
    "title": "Great American Steakhouse Sweet And Sour Dipping Sauce-3 Poi",
    "ingredients": "1 ts Cornstarch|1/3 c Vinegar|2 tb Oil|2/3 c Pineapple juice|2 tb Ketchup|3 tb Brown sugar|1 ds Salt",
    "servings": "4 servings",
    "instructions": "1. In a saucepan, whisk together vinegar and cornstarch. 2. Add remaining ingredients and mix using a wire whisk. 3. Heat until hot. Serve warm. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 135.5 Calories, 6.9g Fat, 0.2g Fiber Weight Watcher Points: 3"
  },
  {
    "title": "Great American Steakhouse Yogurt Herb Dipping Sauce -1 Point",
    "ingredients": "1/2 c Fat-free plain yogurt|1/2 c Fat-free sour cream|1 ts Parsley; chopped|1 ts Cilantro; chopped, optional|1 ts Green onion; chopped|1/2 ts Celery salt",
    "servings": "4 servings",
    "instructions": "1. Combine all ingredients in a small bowl. Mix well. 2. Refrigerate 1-2 hours to allow flavors to blend. Serving Size (1/4 recipe) Per MC Nutritional Analysis: Per Serving: 36.7 Calories, 0.1g Fat, 0.1g Fiber Weight Watcher Points: 1"
  },
  {
    "title": "All - American Club Wraps",
    "ingredients": "8 sl Bacon|4 (8 or 9 inch) garden vegetable flour tortillas|1/2 c Purchased bacon dip|8 Lettuce leaves|1/2 lb Thinly sliced deli cooked turkey breast|1 lg Tomato, seeded, chopped",
    "servings": "4 Wraps",
    "instructions": "Cook bacon until crisp. Drain on paper towel; crumble and set aside. Spread each tortilla evenly with dip to within 1/2 inch of edges."
  }
]
