[
  {
    "title": "Champagne Dessert Cocktails (January)",
    "ingredients": "2 pk Lemon-flavored gelatin; (4 servings each)|2 c Boiling water|2 c Champagne|8 Strawberries; hulled",
    "servings": "8 Servings",
    "instructions": "In a large bowl, dissolve the gelatin in the boiling water; let cool for 10 minutes. Add the champagne and chill for 40 to 45 minutes, until slightly thickened. Reserve 1 cup of the gelatin mixutre and spoon the remaining gelatin mixture evenly into 8 champagne flutes or parfait glasses. Place 1 strawberry in each glass. In a small bowl, with an electric beater on high speed, beat the reserved 1 cup gelatin mixture until fluffy and doubled in volume. Spoon evenly into the glasses, then cover and chill for at least 2 hours until set. Note: This is a perfect way to enjoy leftover champagne. It's also good for times when you want to serve a sparkling dessert."
  },
  {
    "title": "Champagne \"Cocktails\"",
    "ingredients": "2 pk Lemon-flavored gelatin; (4 servings each)|2 c Boiling water|2 c Champagne|8 Whole strawberries; washed and hulled",
    "servings": "1 servings",
    "instructions": "In a large bowl, dissolve the gelatin in the boiling water; allow to cool for 10 minutes. Stir in the champagne and chill for 40 to 45 minutes, or until slightly thickened. Reserve 1 cup of the gelatin mixture and spoon the remaining gelatin mixture evenly into 8 champagne flutes or parfait glasses. Place 1 strawberry in each glass. In a small bowl, with an electric beater on high speed, beat the reserved 1 cup gelatin mixture until fluffy and doubled in volume. Spoon evenly into the glasses, then cover and chill for at least 2 hours, or until set. NOTE: This is a great way to enjoy leftover champagne. But for those who prefer a kid-approved version - you know, with no alcohol - we can use either nonalcoholic champagne or ginger ale. NOTES : 8 servings"
  },
  {
    "title": "Cocktails Meatballs",
    "ingredients": "1 lb Hamburger|1/2 c Bread crumbs|1/3 c Onions -- minced|1/4 c Milk|1 Egg|1 tb Parsley|1/8 ts Pepper|1/2 ts Worcestershire sauce|12 oz Chili sauce (heinz)|10 oz Grape jelly",
    "servings": "15 Servings",
    "instructions": "Mix first eight ingredients and shape into one inch balls. Use a 13 by 9 pan and place one inch of water in it. Place meatballs in pan and bake at 350 for 45-60 minutes. Mix chili sauce and jelly and heat in a sauce pan on the stove until they melt. Add meatballs to the sauce and heat about thirty minutes , stir while heating sauce and meatballs : HELEN LEACH"
  },
  {
    "title": "Negroni Cocktails",
    "ingredients": "1 c Gin|1 c Sweet Italian Vermouth|1 c Campari|6 Lemon-peel twists",
    "servings": "6 Servings",
    "instructions": "Place a dozen ice cubes in a tall pitcher. Add the gin, vermouth, and Campari. Stir and chill. Serve over ice in Old-Fashioned glasses; garnish with twists of lemon peel. AMBROSINO'S NORTH SCOTTSDALE RD., SCOTTSDALE"
  },
  {
    "title": "Cranberry Champagne Cocktails",
    "ingredients": "2 Well-chilled 750 ml bottles Champagne or sparkling cider|1 c Well-chilled cranberry juice cocktail; or to taste|3 tb Grand Marnier or other orange-flavored; or to taste liqueur, (optional)",
    "servings": "1 servings",
    "instructions": "In a large pitcher stir together well the Champagne, the cranberry juice cocktail, and the Grand Marnier. Yield: about 7 cups, or 8 servingst 30 truffles"
  }
]
